# ==========================================
# โจทย์ข้อที่ 4: ตัดเกรด 5 ระดับ
# Input: คะแนนสอบ (จำนวนเต็ม 0-100)
# Output: เกรด A, B, C, D หรือ F
# เงื่อนไข: >=80 ได้ A | >=70 ได้ B | >=60 ได้ C | >=50 ได้ D | น้อยกว่า 50 ได้ F
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
score = int(input("คะแนนสอบ :"))
if score >=80 :
    print("A")
if score >=70 :
    print("B")
if score >=60 :
    print("C")
if score >=50 :
    print("D")
if score <50 :
    print("F")
else :
    grada
